{
    "position": "Разработчик",
    "levels": [
        {
            "name": "Junior",
            "score": 14,
            "level": 1
        },
        {
            "name": "Middle 1",
            "score": 19,
            "level": 2
        },
        {
            "name": "Middle 2",
            "score": 23,
            "level": 2
        },
        {
            "name": "Middle 3",
            "score": 28,
            "level": 2
        },
        {
            "name": "Senior 1",
            "score": 33,
            "level": 3
        },
        {
            "name": "Senior 2",
            "score": 37,
            "level": 3
        },
        {
            "name": "Senior 3",
            "score": 42,
            "level": 3
        }
    ],
    "quiz": [
        {
            "id": 1,
            "subject": "Какой контроль нужен за сотрудником?",
            "description": "Самостоятельно и с соблюдением сроков обеспечивает весь жизненный цикл задачи (с момента, как бизнес принес сформулированную проблему до релиза). <br/> В Skyeng в жизненный цикл задачи входят этапы: тех. ревью (груминг), оценка трудозатрат, разработка, тестирование, выкладка, верификация и сбора метрик",
            "examples": "<b>Пример:</b> бизнес говорит, что конверсия в заявку на обучение просела, и предлагает перенести форму из футера в хэдер страницы. Разработчик проводит тех. ревью, оценивает задачу, берет в разработку, реализовывает, проходит code review, тестирование, выкладывает задачу в прод, убеждается, что все работает как нужно, и вместе с продактом может посмотреть метрики. Чем выше уровень самоходности, тем меньше требуется привлекать руководителя для прохождения всего цикла",
            "choices": [
                {
                    "choice": "Требуется регулярная помощь и контроль",
                    "description": "В среднем каждые 1-2 дня",
                    "value": 1
                },
                {
                    "choice": "Требуется периодический контроль и помощь в ключевых задачах",
                    "description": "В среднем от 2х дней до 2х недель может быть автономен",
                    "value": 2
                },
                {
                    "choice": "Самоходная единица",
                    "description": "Контроль не требуется, консультации возможны. Самостоятельно берет задачу, планирует и делает в адекватные, ожидаемые сроки",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 1,
            "isActive": true,
            "isKeyQuestion": true
        },
        {
            "id": 2,
            "subject": "Умение действовать в условиях неопределенности",
            "description": "При возникновении неопределенности в задаче (касательно требований, реализации, связей, тестирования, аналитики и т.д.) самостоятельно может эту неопределенность устранить",
            "examples": "<b>Пример 1:</b> при реализации задачи сотрудник обнаруживает отсутствующие макеты для верстки. Разработчик без привлечения руководителя договаривается с продактом/дизайнером о том, что делать с этими страницами.<br/><br/><b>Пример 2:</b> при реализации задачи сотрудник обнаруживает, что не хватает api-методов у сервиса соседней команды, к которому должны пойти обращения. Разработчик идет и договаривается с соседней командой о том, что недостающий метод появится в ближайшее время (может договориться, что сделает сам, а команда поревьювит, а может договориться о том, что метод будет реализован в ближайшее время)",
            "choices": [
                {
                    "choice": "Запрашивает помощь руководителя и коллег в условиях неопределенности, задает вопросы",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Предлагает варианты для устранения проблемы, может вывести ситуацию из неопределенности",
                    "description": "Например, после согласования с более опытными коллегами или с подключением коллег",
                    "value": 2
                },
                {
                    "choice": "Самостоятельно выводит ситуацию из неопределенности в короткие сроки, устраняет блокеры",
                    "description": "Например, через кросс-командное взаимодействие, организацию встреч с заинтересованными лицами или хранителями знаний",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 2,
            "isActive": true,
            "isKeyQuestion": true
        },
        {
            "id": 3,
            "subject": "Понимание проблемы",
            "description": "Сотрудник в любой задаче понимает причину её появления. Знает, на что решение задачи влияет в рамках бизнеса, и предлагает улучшения по её решению, опираясь на технический опыт",
            "examples": "<b>Пример:</b> Исходя из своей насмотренности, разработчик может предложить открывать автоматически модальное окно с предложением вместо перекраски кнопки регистрации в красный цвет, чтобы повысить конверсию в регистрацию",
            "choices": [
                {
                    "choice": "Требуется объяснение бизнес-ценности задачи, которая выполняется",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Знает, какие бизнес-проблемы решают задачи, которые он выполняет и какую ценность задачи несут",
                    "description": "",
                    "value": 2
                },
                {
                    "choice": "Проводит бизнес-ревью задачи",
                    "description": "Челленджит предложения бизнеса, подсвечивает слабые места и предлагает улучшения решений или альтернативные пути достижения цели (если требуется)",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 3,
            "isActive": true,
            "isKeyQuestion": true
        },
        {
            "id": 4,
            "subject": "Аргументация и конфронтация",
            "description": "Уверенно может объяснить, почему это решение сейчас не стоит делать, подкрепляя свои рассуждения фактами и опытом (как своим, так и чужим)",
            "examples": "<b>Пример:</b> разработчик подсвечивает бизнесу, что реализация задачи займет значимо больше времени, чем потенциально принесет пользы, или что задачу сейчас лучше решить с помощью готового механизма",
            "choices": [
                {
                    "choice": "Выполняет задачи, не вступая в обсуждения их целей ",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Активно задает вопросы относительно ценности и деталей задачи и решений",
                    "description": "Вступает в диалог с заказчиком/командой (при необходимости с поддержкой руководителя), готов озвучить спорные моменты и свои сомнения/предложения",
                    "value": 2
                },
                {
                    "choice": "Самостоятельно аргументированно доказывает заказчику/команде свою точку зрения, ее связь с бизнесом",
                    "description": "Готов к конструктивному диалогу",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 4,
            "isActive": true,
            "isKeyQuestion": false
        },
        {
            "id": 5,
            "subject": "Стратегическое мышление",
            "description": "Сотрудник решает бизнес-задачи на основе анализа данных  с учетом минимизации затрат и для достижения наилучшего результата для компании в будущем",
            "examples": "<b>Пример:</b>  Задача - реализовать и разместить чат на странице сайта. Сотрудник со стратегическим мышлением рассмотрит масштабирование и переиспользование чата и изначально спланирует его разработку с небольшим увеличением трудозатрат (которые приведут к большой экономии ресурсов в будущем)",
            "choices": [
                {
                    "choice": "Набирается опыта в проектировании решений",
                    "description": "Проектирует решения при участии более опытных коллег",
                    "value": 1
                },
                {
                    "choice": "Проектирует решение, закрывающее текущие потребности бизнеса",
                    "description": "Учится видеть полную картину и предусматривать потенциальные запросы, реализуя готовые к переиспользованию решения",
                    "value": 2
                },
                {
                    "choice": "Проектирует решения, закрывающие цели бизнеса и ориентированные на долгосрочный результат",
                    "description": "На основе анализа данных и с небольшим увеличением затрат",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 5,
            "isActive": true,
            "isKeyQuestion": false
        },
        {
            "id": 6,
            "subject": "Межкомандная работа",
            "description": "Сотрудник самостоятельно взаимодействует с разными командами, вовлекая их в работу, для достижений целей проекта",
            "examples": "<b>Пример:</b> Сотрудник при разработке чата для главной страницы сайта лично контактирует с командой дизайнеров и аналитиков, договаривается о постановке задач и контролирует их выполнение",
            "choices": [
                {
                    "choice": "Работает в рамках своей команды",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Работает в рамках команды, участвует в межкомандных проектах в роли исполнителя",
                    "description": "",
                    "value": 2
                },
                {
                    "choice": "Эффективно лидирует работу по межкомандным задачам",
                    "description": "",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 6,
            "isActive": true,
            "isKeyQuestion": false
        },
        {
            "id": 7,
            "subject": "Ответственность за ошибки",
            "description": "Ответственность и инициативность сотрудника в случае возникновения проблем",
            "examples": "<b>Пример:</b> при возникновении ошибок в проде разработчик проактивно начинает разбираться с ними, прилагая необходимые усилия для устранения проблем. После устранения проблемы проводится ретроспектива и вырабатывается решение, которое позволит не допускать подобных проблем в будущем",
            "choices": [
                {
                    "choice": "В случае критичных ошибок в работе сервиса обращается за помощью к коллегам/руководителю",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "В случае критичных ошибок в работе сервиса подключается и исправляет без просьбы со стороны руководителя",
                    "description": "Исследует и исправляет проблему.",
                    "value": 2
                },
                {
                    "choice": "В случае критичных ошибок в работе сервиса подключается и исправляет без просьбы со стороны руководителя",
                    "description": "Самостоятельно анализирует ошибки и продумывает, как не повторить этих ошибок в будущем. Доводит эти решения до исполнения",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 7,
            "isActive": true,
            "isKeyQuestion": false
        },
        {
            "id": 8,
            "subject": "Performing (скорость и объемы выполненной работы)",
            "description": "Сотрудник эффективно выполняет задачи с учетом скорости, количества взятых задач и качества их выполнения",
            "examples": "",
            "choices": [
                {
                    "choice": "Не ниже или соответствует скорости и производительности других ребят уровня Junior",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Не ниже или соответствует скорости и производительности других ребят уровня Middle",
                    "description": "",
                    "value": 2
                },
                {
                    "choice": "Не ниже или соответствует скорости и производительности других ребят уровня Senior",
                    "description": "",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 8,
            "isActive": true,
            "isKeyQuestion": true
        },
        {
            "id": 9,
            "subject": "Кол-во возвратов на доработку задачи после тестирования из-за ошибок реализации",
            "description": "Разработчик обязательно проверяет задачу до передачи в тестирование. Это снижает нагрузку на тестировщиков, а также ускоряет скорость поставки задачи (возврат в переработку, как правило, влечет за собой увеличение времени поставки).<br/>Стоит отметить, что могут быть \"технические возвраты\" задач, например из-за того, что у тестировщика проблемы с инфраструктурой - такие возвраты мы не считаем",
            "examples": "<b>Пример:</b> Тестировщики редко возвращают задачи разработчику из-за наличия багов. Им сразу понятно, как тестировать задачу и на что она влияет",
            "choices": [
                {
                    "choice": "Допускает ошибки не более, чем в 50% задач",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Тестирует свою работу эффективно, возвращается тестировщиком не более 30% задач",
                    "description": "",
                    "value": 2
                },
                {
                    "choice": "Эффективно тестирует свою работу, возвращается тестировщиком не более 10% задач",
                    "description": "Возврат задач происходит преимущественно из-за ошибок в пограничных сценариях, которые сложно проверить",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 9,
            "isActive": true,
            "isKeyQuestion": false
        },
        {
            "id": 10,
            "subject": "Архитектура сервисов",
            "description": "На старте нового проекта разработчик закладывает архитектуру, которая долгое время позволяет гибко реагировать на запросы бизнеса.<br/>При поддержке существующего проекта происходит постепенное улучшение архитектуры через обычные задачи",
            "examples": "",
            "choices": [
                {
                    "choice": "Строго следует принятым в проекте соглашениям",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Успешно самостоятельно проектирует архитектуру на уровне отдельных задач в проекте",
                    "description": "",
                    "value": 2
                },
                {
                    "choice": "Успешно самостоятельно проектирует архитектуру отдельных сервисов и крупных задач в существующих проектах",
                    "description": "Ориентируется на долгосрочную поддержку и расширяемость функционала",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 10,
            "isActive": true,
            "isKeyQuestion": false
        },
        {
            "id": 11,
            "subject": "Контроль работоспособности сервиса",
            "description": "Разработчик эффективно выстраивает систему контроля работоспособности продуктов, которые разрабатываются.<br/>Может без посещения сервиса ответить на вопрос \"функционирует ли он сейчас?\"",
            "examples": "<b>Пример:</b> разработчик настраивает алертинг для технических и продуктовых метрик, которые сообщат ему о том, что что-то идет не так",
            "choices": [
                {
                    "choice": "Проверяет работоспособность сервиса вручную",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Настраивает технические мониторинги, алертинги для контроля текущей работоспособности сервиса",
                    "description": "",
                    "value": 2
                },
                {
                    "choice": "Выделяет технические, продуктовые и бизнесовые метрики",
                    "description": "Настраивает по ним мониторинг и алертинг для контроля текущей работоспособности",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 11,
            "isActive": true,
            "isKeyQuestion": false
        },
        {
            "id": 12,
            "subject": "Техническое ревью",
            "description": "Техническое ревью - эффективный способ проектирования технического решения. Чем лучше произведено проектирование, тем меньше проблем с сопровождение этой задачи в будущем",
            "examples": "",
            "choices": [
                {
                    "choice": "Принимает участие, как участник. Предлагает улучшения",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Проводит тех.ревью самостоятельно для задач в проекте",
                    "description": "Результаты тех. ревью не отправляются на переработку в большинстве случаев",
                    "value": 2
                },
                {
                    "choice": "Проводит тех. ревью для любого размера задач/проектов, с любой степенью неопределенности",
                    "description": "Результаты тех. ревью не перерабатываются в большинстве случаев. Может оспорить чужое решение и защитить своё",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 12,
            "isActive": true,
            "isKeyQuestion": false
        },
        {
            "id": 13,
            "subject": "Code review",
            "description": "Качество Code Review позволяет на более ранней стадии выявить ошибки, синхронизироваться команде по части написания кода и перенять лучшие практики",
            "examples": "",
            "choices": [
                {
                    "choice": "Преимущественно ревьюируемый и наблюдатель",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Ревьювит сам и получает ревью от других",
                    "description": "",
                    "value": 2
                },
                {
                    "choice": "Ревьювит сам и получает ревью от других",
                    "description": "В процессе ревью корректирует архитектурные решения и подсвечивает проблемы текущей реализации (а не code style)",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 13,
            "isActive": true,
            "isKeyQuestion": false
        },
        {
            "id": 14,
            "subject": "Харды - знание текущего стека",
            "description": "В SkyEng есть описание технического стека и ожидания того, что должны знать инженеры",
            "choices": [
                {
                    "choice": "Знает теорию, мало практики",
                    "description": "",
                    "value": 1
                },
                {
                    "choice": "Знает теорию, уверенная практика",
                    "description": "",
                    "value": 2
                },
                {
                    "choice": "Отлично знает теорию, глубоко понимает технологии",
                    "description": "",
                    "value": 3
                },
                {
                    "choice": "Не знает / не делает / не могу ответить",
                    "description": "",
                    "value": 0
                }
            ],
            "position": 14,
            "isActive": true,
            "isKeyQuestion": true
        }
    ]
}